## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:128" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:128" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:562611768de595d82726ea0ab456b462b6df2f43d90877ca23c10dc81e24ddfa" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:95f36c55d4797bf00d7aabdae205a871e2f5528a0e666d78ee2a14db945ac39a"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 128 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "aa58d7f2c1123b3ad7048bce2dd4c377-6" -> "9aec4e89c018919741d557f4baa1d761"
        id                     = "graphql.9aec4e89c018919741d557f4baa1d761.zip"
        tags                   = {}
      ~ version_id             = "Hp3HZGW7bh7iPNbnTgivTR843xv5_w0I" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "ada4a30aba929324eb23ead6dd3883bf-5" -> "49f6291dc84bb27b95f10c7de8148425"
        id                     = "processValidationJson.49f6291dc84bb27b95f10c7de8148425.zip"
        tags                   = {}
      ~ version_id             = "pGsoW2jX.9H9E4CVh3Ql8VPtM93JHO0N" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.3f9d44216795c485abeb8a7a0b9c585a.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "340ed34769f8cbde291df7d84d567a16-4" -> "ab8ddf1daa40fda65d43943321437cc9"
      ~ id                     = "python.3f9d44216795c485abeb8a7a0b9c585a.zip" -> (known after apply)
      ~ key                    = "python.3f9d44216795c485abeb8a7a0b9c585a.zip" -> "python.ab8ddf1daa40fda65d43943321437cc9.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "3f9d44216795c485abeb8a7a0b9c585a" -> "ab8ddf1daa40fda65d43943321437cc9"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "emZZBEw3j03ozrENp.T40KHzpNvF83Qi" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "b2a0383e4985b88c74bb09eeae950f0a" -> "e2382c9ab0f2de772c575bc898835d8d"
        id                     = "dist/200.html"
      ~ source_hash            = "b2a0383e4985b88c74bb09eeae950f0a" -> "e2382c9ab0f2de772c575bc898835d8d"
        tags                   = {}
      ~ version_id             = "dKo4hee3ct_635AvkWvZDNptzdL8DNXm" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "3e1394c6fccfba7378154ad0bf25a577" -> "79d6fcad599da931332f21bb4340c3a1"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "3e1394c6fccfba7378154ad0bf25a577" -> "79d6fcad599da931332f21bb4340c3a1"
        tags                   = {}
      ~ version_id             = "JoQGv4J1zw9NuUTlStUcpvCVEuq8tzth" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "add3aa1ae55d360591b22fd32075c35c" -> "72de0a43a767c11b0039d6cbb476868e"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "add3aa1ae55d360591b22fd32075c35c" -> "72de0a43a767c11b0039d6cbb476868e"
        tags                   = {}
      ~ version_id             = "pNUqncfRvaoVTa8Y0SFl._0ecqA3DZl8" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "b2a0383e4985b88c74bb09eeae950f0a" -> "e2382c9ab0f2de772c575bc898835d8d"
        id                     = "dist/index.html"
      ~ source_hash            = "b2a0383e4985b88c74bb09eeae950f0a" -> "e2382c9ab0f2de772c575bc898835d8d"
        tags                   = {}
      ~ version_id             = "E6wuCeLaAel0KOlGukkOBD0H_nPIhVzZ" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.46447f9d.js"] will be destroyed
  # (because key ["static/js/app.46447f9d.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.46447f9d.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "5671afc2b65f4b2cbf207395c0f07163" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.46447f9d.js" -> null
-       key                    = "dist/static/js/app.46447f9d.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.46447f9d.js" -> null
-       source_hash            = "5671afc2b65f4b2cbf207395c0f07163" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "bjmcyHIp0XTJqVecF72Jg9JT.Rk4jKnZ" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.46447f9d.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.46447f9d.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.46447f9d.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "3b6b61b80017ed2a756a2cec1364fac3" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.46447f9d.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.46447f9d.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.46447f9d.js.LICENSE.txt" -> null
-       source_hash            = "3b6b61b80017ed2a756a2cec1364fac3" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "TcSjVuoZLyx.49wS4l4hEwOI7IEQUHmN" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.81e3933f.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "12a9de16389d75b003386f62f6117e8c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.81e3933f.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.81e3933f.js"
+       source_hash            = "12a9de16389d75b003386f62f6117e8c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.81e3933f.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "3b6b61b80017ed2a756a2cec1364fac3"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.81e3933f.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.81e3933f.js.LICENSE.txt"
+       source_hash            = "3b6b61b80017ed2a756a2cec1364fac3"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-05-02T15:17:51.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:95" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:95/invocations" -> (known after apply)
      ~ s3_key                         = "python.3f9d44216795c485abeb8a7a0b9c585a.zip" -> "python.ab8ddf1daa40fda65d43943321437cc9.zip"
        tags                           = {}
      ~ version                        = "95" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "222f0f14a4844bf8c3245327c364db558df5b116" -> "67268835de7b5c0c73193c9a11941e6b0e07aabd"
              ~ "DD_TAGS"                      = "git.commit.sha:222f0f14a4844bf8c3245327c364db558df5b116,git.repository_url:https://github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:67268835de7b5c0c73193c9a11941e6b0e07aabd,git.repository_url:https://github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "222f0f14a4844bf8c3245327c364db558df5b116" -> "67268835de7b5c0c73193c9a11941e6b0e07aabd"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "95" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:143" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:143/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "143" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "222f0f14a4844bf8c3245327c364db558df5b116" -> "67268835de7b5c0c73193c9a11941e6b0e07aabd"
              ~ "DD_TAGS"                            = "git.commit.sha:222f0f14a4844bf8c3245327c364db558df5b116,git.repository_url:https://github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:67268835de7b5c0c73193c9a11941e6b0e07aabd,git.repository_url:https://github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "222f0f14a4844bf8c3245327c364db558df5b116" -> "67268835de7b5c0c73193c9a11941e6b0e07aabd"
                # (18 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "143" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:51" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:51/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "51" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "222f0f14a4844bf8c3245327c364db558df5b116" -> "67268835de7b5c0c73193c9a11941e6b0e07aabd"
              ~ "DD_TAGS"                            = "git.commit.sha:222f0f14a4844bf8c3245327c364db558df5b116,git.repository_url:https://github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:67268835de7b5c0c73193c9a11941e6b0e07aabd,git.repository_url:https://github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "222f0f14a4844bf8c3245327c364db558df5b116" -> "67268835de7b5c0c73193c9a11941e6b0e07aabd"
                # (16 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "51" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 10 to change, 7 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8927384261)*